public class Main {

    public static void main(String[] args) {

        int value = 4000;  // стоимость билета
        int bonus = 20; // рубли для одной мили

        System.out.println(value / bonus);
        System.out.println();


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

    }
}